app/views/recipes/show.html.erb

SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = ?  [["recipe_id", 21]]
---
<label>Ingredients List: </label>
<%@recipe.ingredients.each do | ingredient |%>