app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients"
---
    def index
        @allergen = Allergen.all
        @ingredients = Ingredient.all