app/controllers/recipes_controller.rb

SELECT "ingredients".* FROM "ingredients" WHERE 1=0
---
    def new
        @ingredients = Ingredient.all

INSERT INTO "recipe_ingredients" ("recipe_id", "ingredient_id") VALUES (?, ?)  [["recipe_id", 21], ["ingredient_id", 103]]
INSERT INTO "recipes" ("name", "description", "user_id") VALUES (?, ?, ?)  [["name", "Burgers"], ["description", "digsuting burger"], ["user_id", 53]]
---
    def create
        @recipe = Recipe.create(name: params[:recipe][:name], description: params[:recipe][:description], user_id: params[:recipe][:user_id], ingredient_ids: params[:recipe][:ingredient_ids])